run/rhoVoF/jetCrossFlow/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

// Defining the properties as variables first allows it to
// express a property of one phase in terms of the other
// through the parameter file
nu_droplet  1e-6;
nu_ambient  1.453e-5;
rho_droplet 1000;
rho_ambient 1.225;

air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] $nu_ambient;
    rho             rho [ 1 -3 0 0 0 0 0 ] $rho_ambient;
}

water
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] $nu_droplet;
    rho             rho [ 1 -3 0 0 0 0 0 ] $rho_droplet;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 7.2e-2;

surfaceForces
{
  sigma 0.072;
  surfaceTensionForceModel gradAlpha;
  accelerationForceModel gravity;
  gravity  ( 0 -9.81 0); 
  deltaFunctionModel alphaCSF;
}
// ************************************************************************* //
